unit Globals;

interface
Uses Windows, SysUtils, Forms;


//----------------------------------------------------------------------------------
// Блок описания процедур и функций
//----------------------------------------------------------------------------------
procedure InitializeGlobalVariables;



//----------------------------------------------------------------------------------
// Блок типов
//----------------------------------------------------------------------------------
// Тип строки длиной 80 символов
type string80 = string[80];

// Запись кубика (dice)
type cubic = record
       a:Byte;
       b:Byte;
       c:Byte;
     end;

// Запись персонажа
type harka=record
       unm:Byte;
       max:Byte;
       cmd:Byte;
       tmd:Byte;
       imd:Byte;
       now:Byte;

       mmd:Integer;
       nmd:Integer;
     end;
type baseharka=record
       now:integer;
       max:integer;
     end;

type TCharacter=record
       st:harka;
       dex:harka;
       con:harka;
       per:harka;
       int:harka;
       wis:harka;
       cha:harka;
       lck:harka;
       hp:baseharka;
       mp:baseharka;
       att:integer;
       uvert:integer;
       defen:integer;
       pu:integer;
       dmg:cubic;
       kdmg:cubic;
       race:Byte;
       prof:Byte;
       sex:Byte;
       month:Byte;
       day:Byte;
       name:string;
       align:Byte;
     end;

// Запись, отвечающая за время
type timrec=record
       s:shortint;
       m:shortint;
       h:shortint;
       d:shortint;
       g:shortint;
       y:integer;
     end;







//----------------------------------------------------------------------------------
// Блок переменных
//----------------------------------------------------------------------------------
// Персонаж
{var
  h : TCharacter;}

// Дескриптор консольного окна
var
 ConOutHandle, ConInHandle : THandle;

// Для хранения/установки позиции экрана
var
 Coord : TCoord;

// Для хранения результатов некоторых функций модуля MyCrt
var
 NOAW : Cardinal;

// Директория, из которой запущени exe'шник
var
 ExePath : String;

//----------------------------------------------------------------------------------
// Блок констант
//----------------------------------------------------------------------------------
// Версия программы
const
  CProgVersion = 'v1.25a';

// Символы, доступные для задания имени персонажа
const
  CAllLetters = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz _-1234567890';

// Пустая строка длиной 80 символов
const
  CEmptyString = '                                                                                ';

// Названия месяцов
const
  CMonthNames : array[1..12] of string[10] =
               ('Дракона',
                'Единорога',
                'Волка',
                'Василиска',
                'Змеи',
                'Грифона',
                'Зайца',
                'Льва',
                'Тигра',
                'Лошади',
                'Ворона',
                'Мыши');

// Названия полов
const
  CSexNames : array[1..2]of string[10] =
               ('Мужчина',
                'Женщина');

// Названия рас
const
  CRaceNames : array[1..8] of string[12] =
               ('Человек',
                'Гном',
                'Высший Эльф',
                'Темный Эльф',
                'Полурослик',
                'Драконид',
                'Полуорк',
                'Тролль');

// Названия профессий
const
  CProfNames : array[1..16] of string[10] =
               ('Воин',
                'Паладин',
                'Следопыт',
                'Вор',
                'Убийца',
                'Маг',
                'Клирик',
                'Бард',
                'Монах',
                'Лучник',
                'Торговец',
                'Фермер',
                'Псионик',
                'Варвар',
                'Друид',
                'Некромант');

// Возможность выбора определенного мировоззрения персонажам определенной профессии
const
  CProfAligns : array[1..16] of string[10] =
               ('x11111111',
                'x00000000',
                'x11111111',
                '0x1011011',
                '0000x1011',
                'x11111111',
                'x11111111',
                '0x1011011',
                'x00100100',
                'x11111111',
                '0x1111110',
                'x10110110',
                'x11111111',
                '0x1011011',
                '0x0010010',
                '00x001011');

// Названия мировоззрений
const
  CAlignNames : array[1..9] of string[27] =
               ('Законопослушно-доброе',
                'Нейтрально-доброе',
                'Хаотически-доброе',
                'Законопослушно-нейтральное',
                'Нейтральное',
                'Хаотически-нейтральное',
                'Законопослушно-злое',
                'Нейтрально-злое',
                'Хаотически-злое');



implementation

//----------------------------------------------------------------------------------
// Записывает в переменную имя текущего каталога
//----------------------------------------------------------------------------------
procedure InitializeGlobalVariables;
begin;
ExePath := ExtractFilePath(Application.ExeName);
end;

//----------------------------------------------------------------------------------
// Инитиализация
//----------------------------------------------------------------------------------
begin;
end.
